data/idp/blackbox/aa/request03.txt

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/"><Body>
    <Request xmlns="urn:oasis:names:tc:SAML:1.0:protocol" IssueInstant="2004-07-30T18:43:23Z" MajorVersion="1" MinorVersion="1" RequestID="d206a5ba1d50c3afd855dea0b0106cb6" xmlns:saml="urn:oasis:names:tc:SAML:1.0:assertion" xmlns:samlp="urn:oasis:names:tc:SAML:1.0:protocol">
        <AttributeQuery Resource="urn:x-shibtest:SP2">
            <Subject xmlns="urn:oasis:names:tc:SAML:1.0:assertion">
                <NameIdentifier Format="urn:oasis:names:tc:SAML:1.1:nameid-format:unspecified" NameQualifier="urn:x-shibtest:IdP">test-handle</NameIdentifier>
            </Subject>
        </AttributeQuery>
    </Request>
</Body></Envelope>
